-- Клиенты
INSERT INTO clients (
    last_name, first_name, middle_name,
    phone, email, birth_date, reg_date
) VALUES
('Малышев', 'Никита', 'Александрович', '+79000000000', 'mal@mail.ru', '2005-12-24', '2025-10-17'),
('Новикова', 'Мария', 'Алексеевна', '+79000000001', 'marishka@gmail.com', '2007-08-13', '2025-10-18'),
('Уббир', 'Шестьдесят', 'Четыре', '+79661706464', 'ubbir64@art.com', '2000-01-01', '2025-06-01');


-- Автомобили
INSERT INTO cars (
    client_id, vin, plate_number,
    brand, model, year, mileage
) VALUES
(1, 'XTA21099012345678', 'О000ОО70', 'ВАЗ', '2114', 1999, 150000),
(3, 'Z94CT41DBER123456', 'М111ММ154', 'Hyundai', 'Solaris', 2014, 98000),
(3, 'XTA219010V7654321', 'Р142РР142', 'Lada', 'Granta', 2018, 52000);


-- Сотрудники
INSERT INTO employees (
    last_name, first_name, middle_name,
    position, phone, birth_date, hire_date
) VALUES
('Макаров', 'Стас', 'Сергеевич', 'Старший Механик', '+79876543210', '1990-06-13', '2015-06-01'),
('Штирлиц', 'Антон', 'Андреевич', 'Механик', '+79998886767', '1995-07-20', '2019-07-07');


-- Услуги
INSERT INTO services (
    service_name, description, price, duration_minutes
) VALUES
('Замена масла и фильтра', 'Замена моторного масла и масляного фильтра', 2500.00, 60),
('Диагностика двигателя', 'Комплексная компьютерная диагностика двигателя', 3000.00, 60),
('Замена свечей зажигания', 'Замена свечей зажигания', 1800.00, 45),
('Ремонт ходовой части', 'Диагностика и ремонт подвески', 12000.00, 180),
('Замена машины', 'Услуга для крайних случаев', 250000.00, 10800);


-- Заказы
INSERT INTO orders (
    order_number, order_date, client_id, car_id,
    employee_id, status, total_amount, close_date
) VALUES
('ORD-001', '2026-10-07', 1, 1, 1, 'Завершен', 250000.00, '2026-10-17'),
('ORD-002', '2026-10-08', 3, 2, 2, 'Завершен', 4000.00, '2026-10-08'),
('ORD-003', '2026-10-19', 3, 3, 1, 'В работе', 13800.00, NULL);


-- Позиции заказов
INSERT INTO order_services (
    order_id, service_id, quantity, price
) VALUES
(1, 1, 1, 250000.00),
(2, 3, 1, 3000.00),
(3, 3, 1, 1800.00),
(3, 4, 1, 12000.00);